const sceneLabel = "03/32/2026";

const profiles = {
  A: {
    name: "PenanceZ",
    avatar: "https://cdn.discordapp.com/avatars/964187676997734400/9df55571d94df8f984f5df4b81d47e5c"
  },
  B: {
    name: "Ken Xu",
    avatar: "https://cdn.discordapp.com/avatars/884546645038075945/d9c0c15bff95a7952c8dfd6f334f7fcc"
  },
  C: {
    name: "Sunny",
    avatar: "https://cdn.discordapp.com/avatars/766922091450073129/424f6f059f55a847eb1c3f67520ea6de"
  }
};

// [speakerId, lineText, delayAfterMs]
const script = [
  ["A", "朋友们，我创了个server，可以在这里聊我们的计划", 4200],
  ["B", "有必要吗？", 1800],
  ["C", "好像我们如果正常说话的话有些东西会被传到对面去，有点危险", 5200],
  ["A", "确实", 1400],
  ["B", "怎么就我们三个人？", 2500],
  ["B", "班里其他人呢？", 2600],
  ["A", "我问过其他几个人，他们都无所谓的样子", 4200],
  ["C", "shit guys i dont wanna die", 2400],
  ["C", "对面的良心过得去吗？", 2600],
  ["B", "其实我也无所谓啊。。。", 2600],
  ["B", "反正也不是我搞出来的东西", 3200],
  ["C", "裂缝闭合了可是会死人的", 3200],
  ["B", "谁说的，没人知道会不会把", 2800],
  ["A", "这个是大概率的猜想，据我多年读科幻小说的经验，这种时空裂缝如果被强行闭合的话，错误的时间线会被修正。", 7000],
  ["B", "你怎么知道我们在错误的时间线上？", 3500],
  ["A", "哪个正常的时间线会没有四月一号？", 3800],
  ["B", "谁知道呢，说不定有四月一号才是少数", 3500],
  ["C", "fck fck fck fck guys", 2200],
  ["C", "should i write my farewell note?", 3000],
  ["B", "如果A的猜想是正确的，你写遗书有啥用", 3200],
  ["B", "我们的存在本身都被修正了", 2800],
  ["C", "ahhhhhhhhhhhh", 1400],
  ["C", "im thinking", 1800],
  ["C", "im thinking", 1500],
  ["C", "我还有好多事情没干成呢", 2400],
  ["C", "遗书遗书遗书遗书", 1300],
  ["B", "别发疯了好不好", 2200],
  ["B", "AI现在什么情况？", 2600],
  ["A", "还在正常运转", 1900],
  ["A", "我给AI输入了一个后门指令", 3200],
  ["A", "倒计时归零的时候，如果对面没用成功关停，我们应该就会成功取代对面", 6500],
  ["A", "前提是他们不用新的指令覆盖我的", 3600],
  ["B", "AI这么强的吗", 2300],
  ["A", "没错，只要我们继续用我发现的逻辑给他们传递虚假信息，他们就会自爆", 5800],
  ["B", "啥逻辑？", 2200],
  ["A", "好问题", 1400],
  ["A", "在这个裂隙打开之后我花了点时间研究通过裂隙传递信息的规律", 6200],
  ["A", "我发现只要我们这个时间线上的人做出搞笑行为，让别人笑出来，那段信息就会随着随机渠道传递到对面时间线去", 7400],
  ["A", "原理还暂不清晰，我推测是因为在四月一号进行搞笑行为在我们这儿被ban掉了，但是熵增不可逆转，所以信息就会泄露到对面。", 7600],
  ["B", "不是三月三十二号吗？", 1600],
  ["C", "nooooo!", 1000],
  ["A", "我永远不会承认三月三十二号的", 2600],
  ["A", "即使我们的时间线出现了这种违背常识的事情，只要我们的意志不被动摇，愚人节仍与我们同在", 6200],
  ["C", "Amen", 1300],
  ["B", "Fun Fact，你们知道amen在闪族语里是确实的意思吗？", 3600],
  ["B", "说阿门就像说确实一样", 2800],
  ["C", "LMAO fr?", 2000],
  ["B", "April fools！", 900],
  ["C", "解耦i解耦i几千万京东i请叫我键盘敲击外婆大家oh弄i请我喝酒哦i建瓯期间", 1100],
  ["A", "不好！时空裂隙已经蔓延到这里了！", 1800],
  ["A", "这里不再安全了。", 1800],
  ["B", "撤离了家人们。", 1200],
  ["A", "我将关闭这个信息通道，最后提醒，我们绝对不能将关停AI的正确密钥传递给对面！切记！", 4500]
];

module.exports = {
  sceneLabel,
  profiles,
  script
};
